name = input('Здравствуйте! Как Вас зовут? ')
print('Очень приятно, '+name+'! Меня зовут Марк.')
old = int(input('Сколько Вам лет? '))
razn = str(abs(old-78))
if old>78:
    print('Да, '+name+', Вы старше меня на '+razn+' лет.')
else:
    print('Да, '+name+', я старше Вас на '+razn+' лет.')
prog = input('Вам нравится программировать? ')
if prog =='нет':
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')
else:
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')