con1 = input('Собака короткошерстной породы? ')
con2 = input('Рост собаки менее 50 см? ')
if con1 =='да':
    if con2 =='да':
        con3 = input('У собаки короткий хвост? ')
        if con3=='да':
            print('английский бульдог')
        else:
            con4 = input('У собаки длинные уши? ')
            if con4=='да':
                print('гончая')
            else:
                con5 = input('У собаки короткое тело? ')
                if con5=='да':
                    print('мопс')
                else:
                    print("чихуахуа")
    else:
        con3 = input('Собака весит более 50 кг? ')
        if con3=='да':
            print('датский дог')
        else:
            print("фоксхаунд")
else:
    if con2 == 'а':
        con3 = input('У собаки доброжелательный характер? ')
        if con3=='да':
            print('кокер-спаниэль')
        else:
            print("ирландский сеттер")
    else:
        con3 = input('У собаки рост менее 70 см? ')
        if con3=='да':
            con4 = input('У собаки длинные уши? ')
            if con4 =='да':
                print('большой вандейский грифон')
            else:
                print("колли")
        else:
            con4 = input('Окрас рыжий с белыми отметинами? ')
            if con4=='да':
                print('сенбернар')
            else:
                con5 = input('Белоснежный окрас? ')
                if con5=='да':
                    print('ирландский волкодав')
                else:
                    print("ньюфаундлер")
